In [1]:
import numpy as np
import pandas as pd
series=pd.Series([1,30,42,31])
print(series)

0     1
1    30
2    42
3    31
dtype: int64

In [2]:
import pandas as pd

print("Pandas is installed!")

Pandas is installed!

In [3]:
arr1 = np.array([1,2,3,4,5])
series= pd.Series(arr1)
print(arr1)
print()
print(series)
print(series[1:4])

[1 2 3 4 5]

0    1
1    2
2    3
3    4
4    5
dtype: int32
1    2
2    3
3    4
dtype: int32

In [4]:
dict1 = {
    'Name':"PIYUSH",
    'Age' : 20,
    'College': 'IIIT L',
    'Branch': 'CSB'
}
series=pd.Series(dict1)
print(series)
print()
series['Age'] = 19
print(series)

Name       PIYUSH
Age            20
College    IIIT L
Branch        CSB
dtype: object

Name       PIYUSH
Age            19
College    IIIT L
Branch        CSB
dtype: object

In [5]:
print(series['Name': 'College'])

Name       PIYUSH
Age            19
College    IIIT L
dtype: object

In [15]:
n=5
for i in range(n):
    n+=i
print(n)

15

In [19]:
list1=[10,20,30,40]
d1=pd.DataFrame(list1)
print(d1)

    0
0  10
1  20
2  30
3  40

In [20]:
list2=[{'Name':'PIYUSH','Age':20},{'Name':'SID','Age':20},{'Name':'AMRIT','Age':19},{'Name':'ARUN','Age':18}]
s1=pd.Series(list2)
d1=pd.DataFrame(list2)

In [21]:
print(s1)

0    {'Name': 'PIYUSH', 'Age': 20}
1       {'Name': 'SID', 'Age': 20}
2     {'Name': 'AMRIT', 'Age': 19}
3      {'Name': 'ARUN', 'Age': 18}
dtype: object

In [22]:
print(d1)

     Name  Age
0  PIYUSH   20
1     SID   20
2   AMRIT   19
3    ARUN   18

In [27]:
#  OR
list1={'Name': ['PIYUSH','ARUN','AMRIT','SID'], 'AGE':[20,18,19,20]}
dat1= pd.DataFrame(list1)
print(dat1)

     Name  AGE
0  PIYUSH   20
1    ARUN   18
2   AMRIT   19
3     SID   20

In [26]:
print(pd.DataFrame(list1))

     Name  AGE
0  PIYUSH   20
1    ARUN   18
2   AMRIT   19
3     SID   20

In [30]:
# It automatically fill NAN value if no data available
list2=[{'Name':'PIYUSH','Age':20},{'Name':'SID','Age':20},{'Name':'AMRIT','Age':19,"BRANCH":'CSB'},{'Name':'ARUN','Age':18}]

d1=pd.DataFrame(list2)
print(d1)

     Name  Age BRANCH
0  PIYUSH   20    NaN
1     SID   20    NaN
2   AMRIT   19    CSB
3    ARUN   18    NaN

In [14]:
import pandas as pd
# , "BRANCH": ['CSB', 'CSB', 'CSB', 'CS', 'CSAI']
list1 = {'Name': ['PIYUSH', 'ARUN', 'AMRIT', 'SID', 'Swyam'], 'AGE': [20, 18, 19, 20, 19]}
dat1 = pd.DataFrame(list1, index=['1', '2', '3', '4', '5'])
print(dat1)

     Name  AGE
1  PIYUSH   20
2    ARUN   18
3   AMRIT   19
4     SID   20
5   Swyam   19

In [ ]:
# dat1['Roll NO.']=

In [52]:
list2 ={
    'NAME': pd.Series (['PIYUSH','AMRIT','SWYAM','ANURAG'], index = [1,2,3,4]),
    'AGE': pd.Series([20,19,19,19], index = [1,2,3,4]),
   
    
}
df1=pd.DataFrame(list2)
print(df1)

     NAME  AGE
1  PIYUSH   20
2   AMRIT   19
3   SWYAM   19
4  ANURAG   19

In [12]:
import pandas as pd

list2 = {
    'NAME': pd.Series(['PIYUSH', 'AMRIT', 'SWYAM', 'ANURAG']),
    'AGE': pd.Series([20, 19, 19, 19]),
}

# index = [1, 2, 3, 4]

df1 = pd.DataFrame(list2)
print(df1)

     NAME  AGE
0  PIYUSH   20
1   AMRIT   19
2   SWYAM   19
3  ANURAG   19

In [58]:
df1['Branch']=pd.Series(['CSB','CSB','CSAI','CSAI'],
                        index=[1,2,3,4])
print(df1)

     NAME  AGE Branch
1  PIYUSH   20    CSB
2   AMRIT   19    CSB
3   SWYAM   19   CSAI
4  ANURAG   19   CSAI

In [60]:
print(df1['NAME'])
print()
print(df1['AGE'])
print()
print(df1['Branch'])

1    PIYUSH
2     AMRIT
3     SWYAM
4    ANURAG
Name: NAME, dtype: object

1    20
2    19
3    19
4    19
Name: AGE, dtype: int64

1     CSB
2     CSB
3    CSAI
4    CSAI
Name: Branch, dtype: object

In [62]:
# double square bracket for printing like dataframe not like series
print(df1[['AGE']])

   AGE
1   20
2   19
3   19
4   19

In [69]:
print(df1[['NAME','AGE']])
print()
print(df1)

     NAME  AGE
1  PIYUSH   20
2   AMRIT   19
3   SWYAM   19
4  ANURAG   19

     NAME  AGE Branch
1  PIYUSH   20    CSB
2   AMRIT   19    CSB
3   SWYAM   19   CSAI
4  ANURAG   19   CSAI

In [70]:
df1.columns

Index(['NAME', 'AGE', 'Branch'], dtype='object')

In [76]:
# to print row of dataframe we use .loc
print(df1.loc[1])
print()
print(df1.loc[[1]])
print()
print(df1.loc[[3]])

NAME      PIYUSH
AGE           20
Branch       CSB
Name: 1, dtype: object

     NAME  AGE Branch
1  PIYUSH   20    CSB

    NAME  AGE Branch
3  SWYAM   19   CSAI

In [77]:
print(df1.loc[1:4])

     NAME  AGE Branch
1  PIYUSH   20    CSB
2   AMRIT   19    CSB
3   SWYAM   19   CSAI
4  ANURAG   19   CSAI

In [79]:
print(df1.loc[[]])

Empty DataFrame
Columns: [NAME, AGE, Branch]
Index: []

In [25]:
import pandas as pd
list2 ={
    'NAME': pd.Series (['PIYUSH','AMRIT','SWYAM','ANURAG'],index = ['Row1','Row2','Row3','Row4'] ),
    'AGE': pd.Series([20,19,19,19],index = ['Row1','Row2','Row3','Row4']),
    'Branch' : pd.Series(['CSB','CSB','CSAI','CSAI'],index = ['Row1','Row2','Row3','Row4'])

   
    
}

df1=pd.DataFrame(list2)
print(df1)

        NAME  AGE Branch
Row1  PIYUSH   20    CSB
Row2   AMRIT   19    CSB
Row3   SWYAM   19   CSAI
Row4  ANURAG   19   CSAI

In [5]:
print(df1.iloc[[0]])

        NAME  AGE Branch
Row1  PIYUSH   20    CSB

In [9]:
print(df1.iloc[0:4])

        NAME  AGE Branch
Row1  PIYUSH   20    CSB
Row2   AMRIT   19    CSB
Row3   SWYAM   19   CSAI
Row4  ANURAG   19   CSAI

In [13]:
print(df1.iloc[2:4,0:2])

        NAME  AGE
Row3   SWYAM   19
Row4  ANURAG   19

In [28]:
import pandas as pd
row=pd.DataFrame([['ABHAY',19],['SID',20]],columns=['NAME',"AGE"])
row

    NAME  AGE
0  ABHAY   19
1    SID   20

In [33]:
import pandas as pd

list2 ={
    'NAME': pd.Series(['PIYUSH', 'AMRIT', 'SWYAM', 'ANURAG'], index=['Row1', 'Row2', 'Row3', 'Row4']),
    'AGE': pd.Series([20, 19, 19, 19], index=['Row1', 'Row2', 'Row3', 'Row4']),
    'Branch': pd.Series(['CSB', 'CSB', 'CSAI', 'CSAI'], index=['Row1', 'Row2', 'Row3', 'Row4'])
}

df1 = pd.DataFrame(list2)
print(df1)

        NAME  AGE Branch
Row1  PIYUSH   20    CSB
Row2   AMRIT   19    CSB
Row3   SWYAM   19   CSAI
Row4  ANURAG   19   CSAI

In [39]:
row1=pd.DataFrame([['Abhay',19],['Sid',20]],columns = ['NAME','AGE'])
print(row1)

    NAME  AGE
0  Abhay   19
1    Sid   20

In [38]:
import pandas as pd

row1 = pd.DataFrame([['Abhay', 19], ['Sid', 20]], columns=['NAME', 'AGE'])
print(row1)

    NAME  AGE
0  Abhay   19
1    Sid   20

In [10]:
# import pandas as pd
# import numpy as np
# df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
# print(df)


#  df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
#  df.append(df2)
# print(df2)

In [9]:
# import pandas as pd
# import numpy as np

# df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
# print(df)

# df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
# df = df.append(df2)  # Assign the result back to df
# print(df)

In [6]:
import pandas as pd
list2 = [{'Name': 'John','Age':25}, {'Name':'Sam','Age':20},
         {'Name':'Eric','Age':30},{'Name':'Ken','Age':28}]
dataframe2=pd.DataFrame(list2)
# print (dataframe2 [['Name','Age']])
print(dataframe2)

   Name  Age
0  John   25
1   Sam   20
2  Eric   30
3   Ken   28

In [22]:
import pandas as pd
dict1 = {
    'name' :pd.Series (['PIY','ABC','XYZ'],index=[1,2,3]),
    'AGE' : pd.Series(['20','19','19'],index=[1,2,3])
}
df1=pd.DataFrame(dict1)
print(df2)

  name AGE
4  PIY  20
5  ABC  19
6  XYZ  19

In [23]:
dict2 = {
      'name' :pd.Series (['PIY','ABC','XYZ'],index=[4,5,6]),
    'AGE' : pd.Series(['20','19','19'],index=[4,5,6])
}
df2=pd.DataFrame(dict2)
print(df2)

  name AGE
4  PIY  20
5  ABC  19
6  XYZ  19

In [24]:
result=pd.concat([df1,df2])
print(result)

  name AGE
1  PIY  20
2  ABC  19
3  XYZ  19
4  PIY  20
5  ABC  19
6  XYZ  19

In [27]:
result=pd.concat([df1,df2],axis=1)
print(result)

  name  AGE name  AGE
1  PIY   20  NaN  NaN
2  ABC   19  NaN  NaN
3  XYZ   19  NaN  NaN
4  NaN  NaN  PIY   20
5  NaN  NaN  ABC   19
6  NaN  NaN  XYZ   19

In [60]:
list1 = {
    'S.Id': pd.Series(['101','102','103','104','105'],index=[1,2,3,4,5]),
    'Name': pd.Series(['ABC','DEF','GHI','JKL','MNO'],index=[1,2,3,4,5]),
    
}
list2 = {
    'S.Id': pd.Series(['101','102','103','105','106'],index=[1,2,3,4,5]),
    'Course':pd.Series(['DSA','ML','CS','WEBD','AppD'],index=[1,2,3,4,5])
}
df1=pd.DataFrame(list1)
df2=pd.DataFrame(list2)
print(df1)
print()
print(df2)
print()
# if both df have same column name
print(pd.merge(df1,df2,on=['S.Id'],how='outer'))

  S.Id Name
1  101  ABC
2  102  DEF
3  103  GHI
4  104  JKL
5  105  MNO

  S.Id Course
1  101    DSA
2  102     ML
3  103     CS
4  105   WEBD
5  106   AppD

  S.Id Name Course
0  101  ABC    DSA
1  102  DEF     ML
2  103  GHI     CS
3  104  JKL    NaN
4  105  MNO   WEBD
5  106  NaN   AppD

In [57]:
# if both df have diff column name

pd.merge(df1,df2,left_on='S.Id',right_on='S.Id',how='inner')

  S.Id Name Course
0  101  ABC    DSA
1  102  DEF     ML
2  103  GHI     CS
3  105  MNO   WEBD

In [44]:
result=pd.merge(df1,df2,left_on='S.Id',right_on='S.Id',how='inner')
print(result)

  S.Id Name Course
0  101  ABC    DSA
1  102  DEF     ML
2  103  GHI     CS
3  105  MNO   WEBD

In [45]:
pd.merge(df1,df2,left_on='S.Id',right_on='S.Id',how='outer')

  S.Id Name Course
0  101  ABC    DSA
1  102  DEF     ML
2  103  GHI     CS
3  104  JKL    NaN
4  105  MNO   WEBD
5  106  NaN   AppD

In [46]:
pd.merge(df1,df2,left_on='S.Id',right_on='S.Id',how='left')

  S.Id Name Course
0  101  ABC    DSA
1  102  DEF     ML
2  103  GHI     CS
3  104  JKL    NaN
4  105  MNO   WEBD

In [47]:
pd.merge(df1,df2,left_on='S.Id',right_on='S.Id',how='right')

  S.Id Name Course
0  101  ABC    DSA
1  102  DEF     ML
2  103  GHI     CS
3  105  MNO   WEBD
4  106  NaN   AppD

In [62]:
list1 = {
    'S.Id': pd.Series(['101','102','103','104','105'],index=[1,2,3,4,5]),
    'Name': pd.Series(['ABC','DEF','GHI','JKL','MNO'],index=[1,2,3,4,5]),
        'Course':pd.Series(['DSA','ML','CS','WEBD','AppD'],index=[1,2,3,4,5])

}
list2 = {
    'S.Id': pd.Series(['101','102','103','105','106'],index=[1,2,3,4,5]),
        'Name': pd.Series(['BC','EF','GI','KL','NO'],index=[1,2,3,4,5]),

    'Course':pd.Series(['ML','DSA','CS','WEBD','AppD'],index=[1,2,3,4,5])
}
df1=pd.DataFrame(list1)
df2=pd.DataFrame(list2)
print(df1)
print()
print(df2)

  S.Id Name Course
1  101  ABC    DSA
2  102  DEF     ML
3  103  GHI     CS
4  104  JKL   WEBD
5  105  MNO   AppD

  S.Id Name Course
1  101   BC     ML
2  102   EF    DSA
3  103   GI     CS
4  105   KL   WEBD
5  106   NO   AppD

In [63]:
pd.merge(df1,df2,on=['S.Id','Course'])

  S.Id Name_x Course Name_y
0  103    GHI     CS     GI